tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1618_tdd.h
#define ADD2                          522
#define SSP1ADD2                      523
#define ADD3                          524
#define SSP1ADD3                      525
#define ADD4                          526
#define SSP1ADD4                      527
#define ADD5                          528
#define SSP1ADD5                      529
#define ADD6                          530
#define SSP1ADD6                      531
#define ADD7                          532
#define SSP1ADD7                      533
#define SSP1MSK0                      534
#define SSP1MSK                       535
#define MSK0                          536
#define MSK                           537
#define SSP1MSK1                      538
#define MSK1                          539
#define SSP1MSK2                      540
#define MSK2                          541
#define SSP1MSK3                      542
#define MSK3                          543
#define SSP1MSK4                      544
#define MSK4                          545
#define SSP1MSK5                      546
#define MSK5                          547
#define SSP1MSK6                      548
#define MSK6                          549
#define SSP1MSK7                      550
#define MSK7                          551
#define SSP1STAT                      552
#define BF                            553
#define UA                            554
#define R_nW                          555
#define S                             556
#define P                             557
#define D_nA                          558
#define CKE                           559
#define SMP                           560
#define SSP1CON1                      561
#define SSPM0                         562
#define SSPM                          563
#define SSPM1                         564
#define SSPM2                         565
#define SSPM3                         566
#define CKP                           567
#define SSPEN                         568
#define SSPOV                         569
#define WCOL                          570
#define SSP1CON2                      571
#define SSP1CON2_SEN                  572
#define RSEN                          573
#define PEN                           574
#define RCEN                          575
#define ACKEN                         576
#define ACKDT                         577
#define ACKSTAT                       578
#define GCEN                          579
#define SSP1CON3                      580
#define DHEN                          581
#define AHEN                          582
#define SBCDE                         583
#define SDAHT                         584
#define BOEN                          585
#define SCIE                          586
#define PCIE                          587
#define ACKTIM                        588
#define ODCONA                        589
#define ODA0                          590
#define ODA1                          591
#define ODA2                          592
#define ODA4                          593
#define ODA5                          594
#define ODCONB                        595
#define ODB4                          596
#define ODB5                          597
#define ODB6                          598
#define ODB7                          599
#define ODCONC                        600
#define ODC0                          601
#define ODC1                          602
#define ODC2                          603
#define ODC3                          604
#define ODC4                          605
#define ODC5                          606
#define ODC6                          607
#define ODC7                          608
#define CCPR1L                        609
#define CCPR1L_RL                     610
#define CCPR1H                        611
#define CCPR1H_RH                     612
#define CCP1CON                       613
#define CCP1MODE0                     614
#define CCP1CON_MODE0                 615
#define CCP1CON_MODE                  616
#define CCP1MODE                      617
#define CCP1MODE1                     618
#define CCP1CON_MODE1                 619
#define CCP1MODE2                     620
#define CCP1CON_MODE2                 621
#define CCP1MODE3                     622
#define CCP1CON_MODE3                 623
#define CCP1CON_FMT                   624
#define CCP1FMT                       625
#define CCP1CON_OUT                   626
#define CCP1OUT                       627
#define CCP1EN                        628
#define CCP1CON_EN                    629
#define CCP1CAP                       630
#define CCP1CTS0                      631
#define CCP1CAP_CTS                   632
#define CCP1CAP_CTS0                  633
#define CCP1CTS                       634
#define CCP1CTS1                      635
#define CCP1CAP_CTS1                  636
#define CCP1CTS2                      637
#define CCP1CAP_CTS2                  638
#define CCPR2L                        639
#define CCPR2L_RL                     640
#define CCPR2H                        641
#define CCPR2H_RH                     642
#define CCP2CON                       643
#define CCP2MODE                      644
#define CCP2MODE0                     645
#define CCP2CON_MODE0                 646
#define CCP2CON_MODE                  647
#define CCP2MODE1                     648
#define CCP2CON_MODE1                 649
#define CCP2MODE2                     650
#define CCP2CON_MODE2                 651
#define CCP2MODE3                     652
#define CCP2CON_MODE3                 653
#define CCP2FMT                       654
#define CCP2CON_FMT                   655
#define CCP2OUT                       656
#define CCP2CON_OUT                   657
#define CCP2EN                        658
#define CCP2CON_EN                    659
#define CCP2CAP                       660
#define CCP2CAP_CTS                   661
#define CCP2CAP_CTS0                  662
#define CCP2CTS                       663
#define CCP2CTS0                      664
#define CCP2CAP_CTS1                  665
#define CCP2CTS1                      666
#define CCP2CAP_CTS2                  667
#define CCP2CTS2                      668
#define CCPTMRS                       669
#define CCP1TSEL0                     670
#define CCP1TSEL                      671
#define CCP1TSEL1                     672
#define CCP2TSEL0                     673
#define CCP2TSEL                      674
#define CCP2TSEL1                     675
#define P3TSEL                        676
#define P3TSEL0                       677
#define P3TSEL1                       678
#define P4TSEL0                       679
#define P4TSEL                        680
#define P4TSEL1                       681
#define SLRCONA                       682
#define SLRA0                         683
#define SLRA1                         684
#define SLRA2                         685
#define SLRA4                         686
#define SLRA5                         687
#define SLRCONB                       688
#define SLRB4                         689
#define SLRB5                         690
#define SLRB6                         691
#define SLRB7                         692
#define SLRCONC                       693
#define SLRC0                         694
#define SLRC1                         695
#define SLRC2                         696
#define SLRC3                         697
#define SLRC4                         698
#define SLRC5                         699
#define SLRC6                         700
#define SLRC7                         701
#define INLVLA                        702
#define INLVLA0                       703
#define INLVLA1                       704
#define INLVLA2                       705
#define INLVLA3                       706
#define INLVLA4                       707
#define INLVLA5                       708
#define INLVLB                        709
#define INLVLB4                       710
#define INLVLB5                       711
#define INLVLB6                       712
#define INLVLB7                       713
#define INLVLC                        714
#define INLVLC0                       715
#define INLVLC1                       716
#define INLVLC2                       717
#define INLVLC3                       718
#define INLVLC4                       719
#define INLVLC5                       720
#define INLVLC6                       721
#define INLVLC7                       722
#define IOCAP                         723
#define IOCAP0                        724
#define IOCAP1                        725
#define IOCAP2                        726
#define IOCAP3                        727
#define IOCAP4                        728
#define IOCAP5                        729
#define IOCAN0                        730
#define IOCAN                         731
#define IOCAN1                        732
#define IOCAN2                        733
#define IOCAN3                        734
#define IOCAN4                        735
#define IOCAN5                        736
#define IOCAF0                        737
#define IOCAF                         738
#define IOCAF1                        739
#define IOCAF2                        740
#define IOCAF3                        741
#define IOCAF4                        742
#define IOCAF5                        743
#define IOCBP                         744
#define IOCBP4                        745
#define IOCBP5                        746
#define IOCBP6                        747
#define IOCBP7                        748
#define IOCBN                         749
#define IOCBN4                        750
#define IOCBN5                        751
#define IOCBN6                        752
#define IOCBN7                        753
#define IOCBF                         754
#define IOCBF4                        755
#define IOCBF5                        756
#define IOCBF6                        757
#define IOCBF7                        758
#define IOCCP                         759
#define IOCCP0                        760
#define IOCCP1                        761
#define IOCCP2                        762
#define IOCCP3                        763
#define IOCCP4                        764
#define IOCCP5                        765
#define IOCCP6                        766
#define IOCCP7                        767
#define IOCCN                         768
#define IOCCN0                        769
#define IOCCN1                        770
#define IOCCN2                        771
#define IOCCN3                        772
#define IOCCN4                        773
#define IOCCN5                        774
#define IOCCN6                        775
#define IOCCN7                        776
#define IOCCF                         777
#define IOCCF0                        778
#define IOCCF1                        779
#define IOCCF2                        780
#define IOCCF3                        781
#define IOCCF4                        782
#define IOCCF5                        783
#define IOCCF6                        784
#define IOCCF7                        785
#define HIDRVC                        786
#define HIDC4                         787
#define HIDC5                         788
#define T4TMR                         789
#define TMR4                          790
#define T4TMR_TMR                     791
#define T4PR_PR                       792
#define T4PR                          793
#define T4CON                         794
#define T4OUTPS0                      795
#define T4CON_OUTPS                   796
#define T4OUTPS                       797
#define T4CON_OUTPS0                  798
#define T4OUTPS1                      799
#define T4CON_OUTPS1                  800
#define T4CON_OUTPS2                  801
#define T4OUTPS2                      802
#define T4OUTPS3                      803
#define T4CON_OUTPS3                  804
#define T4CON_CKPS0                   805
#define T4CKPS0                       806
#define T4CON_CKPS                    807
#define T4CKPS                        808
#define T4CKPS1                       809
#define T4CON_CKPS1                   810
#define T4CKPS2                       811
#define T4CON_CKPS2                   812
#define T4ON                          813
#define T4CON_ON                      814
#define TMR4ON                        815
#define T4HLT                         816
#define T4MODE                        817
#define T4HLT_MODE                    818
#define T4HLT_MODE0                   819
#define T4MODE0                       820
#define T4HLT_MODE1                   821
#define T4MODE1                       822
#define T4HLT_MODE2                   823
#define T4MODE2                       824
#define T4HLT_MODE3                   825
#define T4MODE3                       826
#define T4HLT_MODE4                   827
#define T4MODE4                       828
#define T4CKSYNC                      829
#define T4HLT_CKSYNC                  830
#define T4HLT_CKPOL                   831
#define T4CKPOL                       832
#define T4PSYNC                       833
#define T4HLT_PSYNC                   834
#define T4CLKCON                      835
#define T4CS                          836
#define T4CLKCON_CS                   837
#define T4CS0                         838
#define T4CLKCON_CS0                  839
#define T4CS1                         840
#define T4CLKCON_CS1                  841
#define T4CS2                         842
#define T4CLKCON_CS2                  843
#define T4CS3                         844
#define T4CLKCON_CS3                  845
#define T4RST                         846
#define T4RSEL0                       847
#define T4RSEL                        848
#define T4RST_RSEL                    849
#define T4RST_RSEL0                   850
#define T4RSEL1                       851
#define T4RST_RSEL1                   852
#define T4RSEL2                       853
#define T4RST_RSEL2                   854
#define T4RSEL3                       855
#define T4RST_RSEL3                   856
#define T6TMR                         857
#define TMR6                          858
#define T6TMR_TMR                     859
#define T6PR_PR                       860
#define T6PR                          861
#define T6CON                         862
#define T6CON_OUTPS0                  863
#define T6OUTPS                       864
#define T6CON_OUTPS                   865
#define T6OUTPS0                      866
#define T6CON_OUTPS1                  867
#define T6OUTPS1                      868
#define T6CON_OUTPS2                  869
#define T6OUTPS2                      870
#define T6CON_OUTPS3                  871
#define T6OUTPS3                      872
#define T6CON_CKPS0                   873
#define T6CKPS                        874
#define T6CKPS0                       875
#define T6CON_CKPS                    876
#define T6CON_CKPS1                   877
#define T6CKPS1                       878
#define T6CON_CKPS2                   879
#define T6CKPS2                       880
#define TMR6ON                        881
#define T6ON                          882
#define T6CON_ON                      883
#define T6HLT                         884
#define T6MODE0                       885
#define T6HLT_MODE0                   886
#define T6HLT_MODE                    887
#define T6MODE                        888
#define T6HLT_MODE1                   889
#define T6MODE1                       890
#define T6HLT_MODE2                   891
#define T6MODE2                       892
#define T6HLT_MODE3                   893
#define T6MODE3                       894
#define T6MODE4                       895
#define T6HLT_MODE4                   896
#define T6CKSYNC                      897
#define T6HLT_CKSYNC                  898
#define T6CKPOL                       899
#define T6HLT_CKPOL                   900
#define T6PSYNC                       901
#define T6HLT_PSYNC                   902
#define T6CLKCON                      903
#define T6CS                          904
#define T6CLKCON_CS                   905
#define T6CLKCON_CS0                  906
#define T6CS0                         907
#define T6CLKCON_CS1                  908
#define T6CS1                         909
#define T6CLKCON_CS2                  910
#define T6CS2                         911
#define T6CLKCON_CS3                  912
#define T6CS3                         913
#define T6RST                         914
#define T6RST_RSEL                    915
#define T6RST_RSEL0                   916
#define T6RSEL                        917
#define T6RSEL0                       918
#define T6RST_RSEL1                   919
#define T6RSEL1                       920
#define T6RSEL2                       921
#define T6RST_RSEL2                   922
#define T6RST_RSEL3                   923
#define T6RSEL3                       924
#define TMR3L                         925
#define TMR3H                         926
#define T3CON                         927
#define TMR3ON                        928
#define T3SYNC                        929
#define T3CKPS                        930
#define T3CKPS0                       931
#define T3CKPS1                       932
#define TMR3CS0                       933
#define TMR3CS                        934
#define TMR3CS1                       935
#define T3GCON                        936
#define T3GSS0                        937
#define T3GSS                         938
#define T3GSS1                        939
#define T3GVAL                        940
#define T3GGO_nDONE                   941
#define T3GSPM                        942
#define T3GTM                         943
#define T3GPOL                        944
#define TMR3GE                        945
#define TMR5L                         946
#define TMR5H                         947
#define T5CON                         948
#define TMR5ON                        949
#define T5SYNC                        950
#define T5CKPS                        951
#define T5CKPS0                       952
#define T5CKPS1                       953
#define TMR5CS0                       954
#define TMR5CS                        955
#define TMR5CS1                       956
#define T5GCON                        957
#define T5GSS                         958
#define T5GSS0                        959
#define T5GSS1                        960
#define T5GVAL                        961
#define T5GGO_nDONE                   962
#define T5GSPM                        963
#define T5GTM                         964
#define T5GPOL                        965
#define TMR5GE                        966
#define PID1SETL                      967
#define PID1SET0                      968
#define SET0                          969
#define PID1SET1                      970
#define SET1                          971
#define SET2                          972
#define PID1SET2                      973
#define SET3                          974
#define PID1SET3                      975
#define SET4                          976
#define PID1SET4                      977
#define SET5                          978
#define PID1SET5                      979
#define SET6                          980
#define PID1SET6                      981
#define SET7                          982
#define PID1SET7                      983
#define PID1SETH                      984
#define SET8                          985
#define PID1SET8                      986
#define SET9                          987
#define PID1SET9                      988
#define SET10                         989
#define PID1SET10                     990
#define SET11                         991
#define PID1SET11                     992
#define SET12                         993
#define PID1SET12                     994
#define SET13                         995
#define PID1SET13                     996
#define SET14                         997
#define PID1SET14                     998
#define SET15                         999
#define PID1SET15                     1000
#define PID1INL                       1001
#define IN0                           1002
#define PID1IN0                       1003
#define IN1                           1004
#define PID1IN1                       1005
#define IN2                           1006
#define PID1IN2                       1007
#define IN3                           1008
#define PID1IN3                       1009
#define IN4                           1010
#define PID1IN4                       1011
#define IN5                           1012
#define PID1IN5                       1013
#define IN6                           1014
#define PID1IN6                       1015
#define IN7                           1016
#define PID1IN7                       1017
#define PID1INH                       1018
#define IN8                           1019
#define PID1IN8                       1020
#define IN9                           1021
#define PID1IN9                       1022
#define PID1IN10                      1023
#define IN10                          1024
#define PID1IN11                      1025
#define IN11                          1026
#define PID1IN12                      1027
#define IN12                          1028
#define PID1IN13                      1029
#define IN13                          1030
#define PID1IN14                      1031
#define IN14                          1032
#define IN15                          1033
#define PID1IN15                      1034
#define PID1K1L                       1035
#define K10                           1036
#define PID1K10                       1037
#define K11                           1038
#define PID1K11                       1039
#define K12                           1040
#define PID1K12                       1041
#define K13                           1042
#define PID1K13                       1043
#define K14                           1044
#define PID1K14                       1045
#define K15                           1046
#define PID1K15                       1047
#define K16                           1048
#define PID1K16                       1049
#define K17                           1050
#define PID1K17                       1051
#define PID1K1H                       1052
#define K18                           1053
#define PID1K18                       1054
#define K19                           1055
#define PID1K19                       1056
#define PID1K110                      1057
#define K110                          1058
#define PID1K111                      1059
#define K111                          1060
#define PID1K112                      1061
#define K112                          1062
#define PID1K113                      1063
#define K113                          1064
#define PID1K114                      1065
#define K114                          1066
#define PID1K115                      1067
#define K115                          1068
#define PID1K2L                       1069
#define K20                           1070
#define PID1K20                       1071
#define K21                           1072
#define PID1K21                       1073
#define K22                           1074
#define PID1K22                       1075
#define K23                           1076
#define PID1K23                       1077
#define K24                           1078
#define PID1K24                       1079
#define K25                           1080
#define PID1K25                       1081
#define K26                           1082
#define PID1K26                       1083
#define K27                           1084
#define PID1K27                       1085
#define PID1K2H                       1086
#define K28                           1087
#define PID1K28                       1088
#define K29                           1089
#define PID1K29                       1090
