tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1618_tdd.h
#define PID1K210                      1091
#define K210                          1092
#define PID1K211                      1093
#define K211                          1094
#define PID1K212                      1095
#define K212                          1096
#define PID1K213                      1097
#define K213                          1098
#define PID1K214                      1099
#define K214                          1100
#define PID1K215                      1101
#define K215                          1102
#define PID1K3L                       1103
#define K30                           1104
#define PID1K30                       1105
#define K31                           1106
#define PID1K31                       1107
#define K32                           1108
#define PID1K32                       1109
#define K33                           1110
#define PID1K33                       1111
#define K34                           1112
#define PID1K34                       1113
#define K35                           1114
#define PID1K35                       1115
#define K36                           1116
#define PID1K36                       1117
#define K37                           1118
#define PID1K37                       1119
#define PID1K3H                       1120
#define K38                           1121
#define PID1K38                       1122
#define PID1K39                       1123
#define K39                           1124
#define K310                          1125
#define PID1K310                      1126
#define K311                          1127
#define PID1K311                      1128
#define K312                          1129
#define PID1K312                      1130
#define K313                          1131
#define PID1K313                      1132
#define K314                          1133
#define PID1K314                      1134
#define K315                          1135
#define PID1K315                      1136
#define PID1OUTLL                     1137
#define OUT0                          1138
#define PID1OUT0                      1139
#define OUT1                          1140
#define PID1OUT1                      1141
#define OUT2                          1142
#define PID1OUT2                      1143
#define OUT3                          1144
#define PID1OUT3                      1145
#define OUT4                          1146
#define PID1OUT4                      1147
#define OUT5                          1148
#define PID1OUT5                      1149
#define OUT6                          1150
#define PID1OUT6                      1151
#define OUT7                          1152
#define PID1OUT7                      1153
#define PID1OUTLH                     1154
#define OUT8                          1155
#define PID1OUT8                      1156
#define OUT9                          1157
#define PID1OUT9                      1158
#define PID1OUT10                     1159
#define OUT10                         1160
#define PID1OUT11                     1161
#define OUT11                         1162
#define OUT12                         1163
#define PID1OUT12                     1164
#define OUT13                         1165
#define PID1OUT13                     1166
#define PID1OUT14                     1167
#define OUT14                         1168
#define PID1OUT15                     1169
#define OUT15                         1170
#define PID1OUTHL                     1171
#define PID1OUT16                     1172
#define OUT16                         1173
#define PID1OUT17                     1174
#define OUT17                         1175
#define OUT18                         1176
#define PID1OUT18                     1177
#define OUT19                         1178
#define PID1OUT19                     1179
#define OUT20                         1180
#define PID1OUT20                     1181
#define OUT21                         1182
#define PID1OUT21                     1183
#define OUT22                         1184
#define PID1OUT22                     1185
#define OUT23                         1186
#define PID1OUT23                     1187
#define PID1OUTHH                     1188
#define OUT24                         1189
#define PID1OUT24                     1190
#define OUT25                         1191
#define PID1OUT25                     1192
#define OUT26                         1193
#define PID1OUT26                     1194
#define OUT27                         1195
#define PID1OUT27                     1196
#define OUT28                         1197
#define PID1OUT28                     1198
#define OUT29                         1199
#define PID1OUT29                     1200
#define PID1OUT30                     1201
#define OUT30                         1202
#define OUT31                         1203
#define PID1OUT31                     1204
#define PID1OUTU                      1205
#define OUT32                         1206
#define PID1OUT32                     1207
#define OUT33                         1208
#define PID1OUT33                     1209
#define OUT34                         1210
#define PID1OUT34                     1211
#define OUT35                         1212
#define PID1OUT35                     1213
#define PID1Z1L                       1214
#define PID1Z10                       1215
#define Z10                           1216
#define PID1Z11                       1217
#define Z11                           1218
#define PID1Z12                       1219
#define Z12                           1220
#define PID1Z13                       1221
#define Z13                           1222
#define PID1Z14                       1223
#define Z14                           1224
#define PID1Z15                       1225
#define Z15                           1226
#define PID1Z16                       1227
#define Z16                           1228
#define PID1Z17                       1229
#define Z17                           1230
#define PID1Z1H                       1231
#define Z18                           1232
#define PID1Z18                       1233
#define Z19                           1234
#define PID1Z19                       1235
#define Z110                          1236
#define PID1Z110                      1237
#define Z111                          1238
#define PID1Z111                      1239
#define Z112                          1240
#define PID1Z112                      1241
#define Z113                          1242
#define PID1Z113                      1243
#define Z114                          1244
#define PID1Z114                      1245
#define Z115                          1246
#define PID1Z115                      1247
#define PID1Z1U                       1248
#define Z116                          1249
#define PID1Z116                      1250
#define PID1Z2L                       1251
#define Z20                           1252
#define PID1Z20                       1253
#define Z21                           1254
#define PID1Z21                       1255
#define Z22                           1256
#define PID1Z22                       1257
#define Z23                           1258
#define PID1Z23                       1259
#define Z24                           1260
#define PID1Z24                       1261
#define Z25                           1262
#define PID1Z25                       1263
#define Z26                           1264
#define PID1Z26                       1265
#define Z27                           1266
#define PID1Z27                       1267
#define PID1Z2H                       1268
#define Z28                           1269
#define PID1Z28                       1270
#define Z29                           1271
#define PID1Z29                       1272
#define PID1Z210                      1273
#define Z210                          1274
#define PID1Z211                      1275
#define Z211                          1276
#define PID1Z212                      1277
#define Z212                          1278
#define PID1Z213                      1279
#define Z213                          1280
#define PID1Z214                      1281
#define Z214                          1282
#define PID1Z215                      1283
#define Z215                          1284
#define PID1Z2U                       1285
#define PID1Z216                      1286
#define Z216                          1287
#define PID1ACCLL                     1288
#define PID1ACCLL_ACC0                1289
#define PID1ACC0                      1290
#define PID1ACCLL_ACC1                1291
#define PID1ACC1                      1292
#define PID1ACCLL_ACC2                1293
#define PID1ACC2                      1294
#define PID1ACCLL_ACC3                1295
#define PID1ACC3                      1296
#define PID1ACCLL_ACC4                1297
#define PID1ACC4                      1298
#define PID1ACCLL_ACC5                1299
#define PID1ACC5                      1300
#define PID1ACCLL_ACC6                1301
#define PID1ACC6                      1302
#define PID1ACCLL_ACC7                1303
#define PID1ACC7                      1304
#define PID1ACCLH                     1305
#define PID1ACCLH_ACC8                1306
#define PID1ACC8                      1307
#define PID1ACCLH_ACC9                1308
#define PID1ACC9                      1309
#define PID1ACC10                     1310
#define PID1ACCLH_ACC10               1311
#define PID1ACC11                     1312
#define PID1ACCLH_ACC11               1313
#define PID1ACC12                     1314
#define PID1ACCLH_ACC12               1315
#define PID1ACC13                     1316
#define PID1ACCLH_ACC13               1317
#define PID1ACC14                     1318
#define PID1ACCLH_ACC14               1319
#define PID1ACC15                     1320
#define PID1ACCLH_ACC15               1321
#define PID1ACCHL                     1322
#define PID1ACC16                     1323
#define ACC16                         1324
#define PID1ACC17                     1325
#define ACC17                         1326
#define PID1ACC18                     1327
#define ACC18                         1328
#define PID1ACC19                     1329
#define ACC19                         1330
#define ACC20                         1331
#define PID1ACC20                     1332
#define ACC21                         1333
#define PID1ACC21                     1334
#define ACC22                         1335
#define PID1ACC22                     1336
#define ACC23                         1337
#define PID1ACC23                     1338
#define PID1ACCHH                     1339
#define ACC24                         1340
#define PID1ACC24                     1341
#define ACC25                         1342
#define PID1ACC25                     1343
#define ACC26                         1344
#define PID1ACC26                     1345
#define ACC27                         1346
#define PID1ACC27                     1347
#define ACC28                         1348
#define PID1ACC28                     1349
#define ACC29                         1350
#define PID1ACC29                     1351
#define PID1ACC30                     1352
#define ACC30                         1353
#define ACC31                         1354
#define PID1ACC31                     1355
#define PID1ACCU                      1356
#define ACC32                         1357
#define PID1ACC32                     1358
#define ACC33                         1359
#define PID1ACC33                     1360
#define PID1ACC34                     1361
#define ACC34                         1362
#define PID1CON                       1363
#define PID1CON_MODE0                 1364
#define PID1MODE0                     1365
#define PID1CON_MODE                  1366
#define PID1MODE                      1367
#define PID1CON_MODE1                 1368
#define PID1MODE1                     1369
#define PID1CON_MODE2                 1370
#define PID1MODE2                     1371
#define PID1CON_BUSY                  1372
#define PID1BUSY                      1373
#define PID1EN                        1374
#define PID1CON_EN                    1375
#define PWM3DCL                       1376
#define PWM3DC0                       1377
#define PWM3DCL_PWMPW0                1378
#define PWM3DCL_DC0                   1379
#define PWM3DCL_DC                    1380
#define PWM3DC1                       1381
#define PWM3DCL_PWMPW1                1382
#define PWM3DCL_DC1                   1383
#define PWM3DCH                       1384
#define PWM3DC2                       1385
#define PWM3DCH_DC2                   1386
#define PWM3DCH_DC                    1387
#define PWM3DCH_PWMPW2                1388
#define PWM3DC3                       1389
#define PWM3DCH_DC3                   1390
#define PWM3DCH_PWMPW3                1391
#define PWM3DC4                       1392
#define PWM3DCH_DC4                   1393
#define PWM3DCH_PWMPW4                1394
#define PWM3DC5                       1395
#define PWM3DCH_DC5                   1396
#define PWM3DCH_PWMPW5                1397
#define PWM3DC6                       1398
#define PWM3DCH_DC6                   1399
#define PWM3DCH_PWMPW6                1400
#define PWM3DC7                       1401
#define PWM3DCH_DC7                   1402
#define PWM3DCH_PWMPW7                1403
#define PWM3DC8                       1404
#define PWM3DCH_DC8                   1405
#define PWM3DCH_PWMPW8                1406
#define PWM3DC9                       1407
#define PWM3DCH_DC9                   1408
#define PWM3DCH_PWMPW9                1409
#define PWM3CON                       1410
#define PWM3CON_POL                   1411
#define PWM3POL                       1412
#define PWM3CON_OUT                   1413
#define PWM3OUT                       1414
#define PWM3EN                        1415
#define PWM3CON_EN                    1416
#define PWM4DCL                       1417
#define PWM4DCL_PWMPW0                1418
#define PWM4DCL_DC                    1419
#define PWM4DC0                       1420
#define PWM4DCL_DC0                   1421
#define PWM4DCL_PWMPW1                1422
#define PWM4DC1                       1423
#define PWM4DCL_DC1                   1424
#define PWM4DCH                       1425
#define PWM4DCH_PWMPW2                1426
#define PWM4DCH_DC                    1427
#define PWM4DC2                       1428
#define PWM4DCH_DC2                   1429
#define PWM4DCH_PWMPW3                1430
#define PWM4DC3                       1431
#define PWM4DCH_DC3                   1432
#define PWM4DCH_PWMPW4                1433
#define PWM4DC4                       1434
#define PWM4DCH_DC4                   1435
#define PWM4DCH_PWMPW5                1436
#define PWM4DC5                       1437
#define PWM4DCH_DC5                   1438
#define PWM4DCH_PWMPW6                1439
#define PWM4DC6                       1440
#define PWM4DCH_DC6                   1441
#define PWM4DCH_PWMPW7                1442
#define PWM4DC7                       1443
#define PWM4DCH_DC7                   1444
#define PWM4DCH_PWMPW8                1445
#define PWM4DC8                       1446
#define PWM4DCH_DC8                   1447
#define PWM4DCH_PWMPW9                1448
#define PWM4DC9                       1449
#define PWM4DCH_DC9                   1450
#define PWM4CON                       1451
#define PWM4POL                       1452
#define PWM4CON_POL                   1453
#define PWM4CON_OUT                   1454
#define PWM4OUT                       1455
#define PWM4EN                        1456
#define PWM4CON_EN                    1457
#define CWG1DBR0                      1458
#define CWG1DBR                       1459
#define DBR                           1460
#define DBR0                          1461
#define CWG1DBR1                      1462
#define DBR1                          1463
#define CWG1DBR2                      1464
#define DBR2                          1465
#define CWG1DBR3                      1466
#define DBR3                          1467
#define CWG1DBR4                      1468
#define DBR4                          1469
#define CWG1DBR5                      1470
#define DBR5                          1471
#define CWG1DBF                       1472
#define CWG1DBF0                      1473
#define DBF                           1474
#define DBF0                          1475
#define CWG1DBF1                      1476
#define DBF1                          1477
#define CWG1DBF2                      1478
#define DBF2                          1479
#define CWG1DBF3                      1480
#define DBF3                          1481
#define CWG1DBF4                      1482
#define DBF4                          1483
#define DBF5                          1484
#define CWG1DBF5                      1485
#define CWG1AS0                       1486
#define CWG1LSAC                      1487
#define LSAC                          1488
#define LSAC0                         1489
#define CWG1LSAC0                     1490
#define LSAC1                         1491
#define CWG1LSAC1                     1492
#define LSBD0                         1493
#define CWG1LSBD0                     1494
#define LSBD                          1495
#define CWG1LSBD                      1496
#define LSBD1                         1497
#define CWG1LSBD1                     1498
#define CWG1REN                       1499
#define REN                           1500
#define CWG1SHUTDOWN                  1501
#define SHUTDOWN                      1502
#define CWG1AS1                       1503
#define INAS                          1504
#define CWG1INAS                      1505
#define C1AS                          1506
#define CWG1C1AS                      1507
#define C2AS                          1508
#define CWG1C2AS                      1509
#define TMR2AS                        1510
#define CWG1TMR2AS                    1511
#define CWG1TMR4AS                    1512
#define TMR4AS                        1513
#define CWG1TMR6AS                    1514
#define TMR6AS                        1515
#define CWG1OCON0                     1516
#define CWG1STRA                      1517
#define STRA                          1518
#define STRB                          1519
#define CWG1STRB                      1520
#define CWG1STRC                      1521
#define STRC                          1522
#define CWG1STRD                      1523
#define STRD                          1524
#define OVRA                          1525
#define CWG1OVRA                      1526
#define CWG1OVRB                      1527
#define OVRB                          1528
#define OVRC                          1529
#define CWG1OVRC                      1530
#define OVRD                          1531
#define CWG1OVRD                      1532
#define CWG1CON0                      1533
#define CWG1MODE0                     1534
#define CWG1CON0_MODE0                1535
#define CWG1MODE                      1536
#define CWG1CON0_MODE                 1537
#define CWG1MODE1                     1538
#define CWG1CON0_MODE1                1539
#define CWG1MODE2                     1540
#define CWG1CON0_MODE2                1541
#define LD                            1542
#define CWG1LD                        1543
#define CWG1CON0_EN                   1544
#define CWG1EN                        1545
#define G1EN                          1546
#define CWG1CON1                      1547
#define CWG1POLA                      1548
#define POLA                          1549
#define CWG1POLB                      1550
#define POLB                          1551
#define CWG1POLC                      1552
#define POLC                          1553
#define CWG1POLD                      1554
#define POLD                          1555
#define IN                            1556
#define CWG1IN                        1557
#define CWG1CLKCON                    1558
#define CWG1CLKCON_CS                 1559
#define CWG1CS                        1560
#define CWG1ISM                       1561
#define CWG1IS                        1562
#define IS                            1563
#define IS0                           1564
#define CWG1IS0                       1565
#define CWG1IS1                       1566
#define IS1                           1567
#define IS2                           1568
#define CWG1IS2                       1569
#define IS3                           1570
#define CWG1IS3                       1571
#define WDTCON0                       1572
#define WDTCON0_SEN                   1573
#define SWDTEN                        1574
#define WDTSEN                        1575
#define WDTPS                         1576
#define WDTPS0                        1577
#define WDTPS1                        1578
#define WDTPS2                        1579
#define WDTPS3                        1580
#define WDTPS4                        1581
#define WDTCON1                       1582
#define WDTWINDOW0                    1583
#define WINDOW0                       1584
#define WINDOW                        1585
#define WDTWINDOW                     1586
#define WDTWINDOW1                    1587
#define WINDOW1                       1588
#define WDTWINDOW2                    1589
#define WINDOW2                       1590
#define WDTCS                         1591
#define WDTCS0                        1592
#define WDTCS1                        1593
#define WDTCS2                        1594
#define WDTPSL                        1595
#define WDTPSL_WDTPSCNT               1596
#define WDTPSL_PSCNT                  1597
#define WDTPSCNT0                     1598
#define PSCNT0                        1599
#define WDTPSCNT1                     1600
#define PSCNT1                        1601
#define WDTPSCNT2                     1602
#define PSCNT2                        1603
#define WDTPSCNT3                     1604
#define PSCNT3                        1605
#define WDTPSCNT4                     1606
#define PSCNT4                        1607
#define WDTPSCNT5                     1608
#define PSCNT5                        1609
#define WDTPSCNT6                     1610
#define PSCNT6                        1611
#define WDTPSCNT7                     1612
#define PSCNT7                        1613
#define WDTPSH                        1614
#define PSCNT8                        1615
#define WDTPSH_WDTPSCNT               1616
#define WDTPSH_PSCNT                  1617
#define WDTPSCNT8                     1618
#define PSCNT9                        1619
#define WDTPSCNT9                     1620
#define PSCNT10                       1621
#define WDTPSCNT10                    1622
#define PSCNT11                       1623
#define WDTPSCNT11                    1624
#define PSCNT12                       1625
#define WDTPSCNT12                    1626
#define PSCNT13                       1627
#define WDTPSCNT13                    1628
#define PSCNT14                       1629
#define WDTPSCNT14                    1630
#define PSCNT15                       1631
#define WDTPSCNT15                    1632
#define PSCNT16                       1633
#define WDTPSCNT16                    1634
#define WDTPSCNT17                    1635
#define PSCNT17                       1636
#define STATE                         1637
#define WDTSTATE                      1638
#define WDTTMR                        1639
#define WDTTMR0                       1640
#define WDTTMR1                       1641
#define WDTTMR2                       1642
#define WDTTMR3                       1643
#define WDTTMR4                       1644
#define SCANLADRL                     1645
#define SCANLADRL_LADR                1646
#define LDAR0                         1647
#define SCANLADRL_SCANLADR            1648
