tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1618_tdd.h
#define SCANLADR0                     1649
#define SCANLADR1                     1650
#define LDAR1                         1651
#define LADR2                         1652
#define SCANLADR2                     1653
#define LADR3                         1654
#define SCANLADR3                     1655
#define LADR4                         1656
#define SCANLADR4                     1657
#define LADR5                         1658
#define SCANLADR5                     1659
#define SCANLADR6                     1660
#define LADR6                         1661
#define LADR7                         1662
#define SCANLADR7                     1663
#define SCANLADRH                     1664
#define LADR8                         1665
#define SCANLADRH_SCANLADR            1666
#define SCANLADR8                     1667
#define SCANLADRH_LADR                1668
#define LADR9                         1669
#define SCANLADR9                     1670
#define LADR10                        1671
#define SCANLADR10                    1672
#define SCANLADR11                    1673
#define LADR11                        1674
#define LADR12                        1675
#define SCANLADR12                    1676
#define LADR13                        1677
#define SCANLADR13                    1678
#define LADR14                        1679
#define SCANLADR14                    1680
#define LADR15                        1681
#define SCANLADR15                    1682
#define SCANHADRL                     1683
#define SCANHADR0                     1684
#define HADR0                         1685
#define SCANHADRL_HADR                1686
#define SCANHADRL_SCANHADR            1687
#define SCANHADR1                     1688
#define HADR1                         1689
#define SCANHADR2                     1690
#define HARD2                         1691
#define SCANHADR3                     1692
#define HADR3                         1693
#define SCANHADR4                     1694
#define HADR4                         1695
#define SCANHADR5                     1696
#define HADR5                         1697
#define SCANHADR6                     1698
#define HADR6                         1699
#define SCANHADR7                     1700
#define HADR7                         1701
#define SCANHADRH                     1702
#define HADR8                         1703
#define SCANHADRH_SCANHADR            1704
#define SCANHADR8                     1705
#define SCANHADRH_HADR                1706
#define HADR9                         1707
#define SCANHADR9                     1708
#define HADR10                        1709
#define SCANHADR10                    1710
#define SCANHADR11                    1711
#define HADR11                        1712
#define HADR12                        1713
#define SCANHADR12                    1714
#define HADR13                        1715
#define SCANHADR13                    1716
#define HADR14                        1717
#define SCANHADR14                    1718
#define HADR15                        1719
#define SCANHADR15                    1720
#define SCANCON0                      1721
#define SCANMODE                      1722
#define SCANMODE0                     1723
#define SCANCON0_MODE0                1724
#define SCANCON0_MODE                 1725
#define SCANCON0_MODE1                1726
#define SCANMODE1                     1727
#define INTM                          1728
#define SCANINTM                      1729
#define INVALID                       1730
#define SCANINVALID                   1731
#define SCANCON0_BUSY                 1732
#define SCANBUSY                      1733
#define SCANGO                        1734
#define SCANEN                        1735
#define SCANCON0_EN                   1736
#define SCANTRIG                      1737
#define TSEL0                         1738
#define TSEL                          1739
#define SCANTSEL0                     1740
#define SCANTSEL                      1741
#define TSEL1                         1742
#define SCANTSEL1                     1743
#define TSEL2                         1744
#define SCANTSEL2                     1745
#define TSEL3                         1746
#define SCANTSEL3                     1747
#define CRCDATL                       1748
#define CRCDATL_DAT                   1749
#define CRCDAT0                       1750
#define DAT0                          1751
#define CRCDATL_CRCDAT                1752
#define CRCDAT1                       1753
#define DAT1                          1754
#define CRCDAT2                       1755
#define DAT2                          1756
#define CRCDAT3                       1757
#define DAT3                          1758
#define CRCDAT4                       1759
#define DAT4                          1760
#define CRCDAT5                       1761
#define DAT5                          1762
#define CRCDAT6                       1763
#define DAT6                          1764
#define DAT7                          1765
#define CRDCDAT7                      1766
#define CRCDATH                       1767
#define CRCDAT8                       1768
#define DAT8                          1769
#define CRCDATH_CRCDAT                1770
#define CRCDATH_DAT                   1771
#define CRCDAT9                       1772
#define DAT9                          1773
#define DAT10                         1774
#define CRCDAT10                      1775
#define DAT11                         1776
#define CRCDAT11                      1777
#define DAT12                         1778
#define CRCDAT12                      1779
#define DAT13                         1780
#define CRCDAT13                      1781
#define DAT14                         1782
#define CRCDAT14                      1783
#define DAT15                         1784
#define CRCDAT15                      1785
#define CRCACCL                       1786
#define CRCACCL_CRCACC                1787
#define CRCACC0                       1788
#define CRCACCL_ACC0                  1789
#define CRCACCL_ACC                   1790
#define CRCACC1                       1791
#define CRCACCL_ACC1                  1792
#define CRCACC2                       1793
#define CRCACCL_ACC2                  1794
#define CRCACC3                       1795
#define CRCACCL_ACC3                  1796
#define CRCACC4                       1797
#define CRCACCL_ACC4                  1798
#define CRCACC5                       1799
#define CRCACCL_ACC5                  1800
#define CRCACC6                       1801
#define CRCACCL_ACC6                  1802
#define CRCACC7                       1803
#define CRCACCL_ACC7                  1804
#define CRCACCH                       1805
#define CRCACCH_ACC                   1806
#define CRCACCH_CRCACC                1807
#define CRCACC8                       1808
#define CRCACCH_ACC8                  1809
#define CRCACC9                       1810
#define CRCACCH_ACC9                  1811
#define CRCACCH_ACC10                 1812
#define CRCACC10                      1813
#define CRCACCH_ACC11                 1814
#define CRCACC11                      1815
#define CRCACCH_ACC12                 1816
#define CRCACC12                      1817
#define CRCACCH_ACC13                 1818
#define CRCACC13                      1819
#define CRCACCH_ACC14                 1820
#define CRCACC14                      1821
#define CRCACCH_ACC15                 1822
#define CRCACC15                      1823
#define CRCSHIFTL                     1824
#define CRCSHIFTL_CRCSHIFT            1825
#define CRCSHIFTL_SHIFT               1826
#define SHIFT0                        1827
#define CRCSHIFT0                     1828
#define SHIFT1                        1829
#define CRCSHIFT1                     1830
#define SHIFT2                        1831
#define CRCSHIFT2                     1832
#define SHIFT3                        1833
#define CRCSHIFT3                     1834
#define SHIFT4                        1835
#define CRCSHIFT4                     1836
#define SHIFT5                        1837
#define CRCSHIFT5                     1838
#define SHIFT6                        1839
#define CRCSHIFT6                     1840
#define SHIFT7                        1841
#define CRCSHIFT7                     1842
#define CRCSHIFTH                     1843
#define CRCSHIFT8                     1844
#define CRCSHIFTH_SHIFT               1845
#define CRCSHIFTH_CRCSHIFT            1846
#define SHIFT8                        1847
#define CRCSHIFT9                     1848
#define SHIFT9                        1849
#define SHIFT10                       1850
#define CRCSHIFT10                    1851
#define SHIFT11                       1852
#define CRCSHIFT11                    1853
#define SHIFT12                       1854
#define CRCSHIFT12                    1855
#define SHIFT13                       1856
#define CRCSHIFT13                    1857
#define CRCSHIFT14                    1858
#define SHIFT14                       1859
#define SHIFT15                       1860
#define CRCSHIFT15                    1861
#define CRCXORL                       1862
#define XOR1                          1863
#define CRCXOR1                       1864
#define XOR2                          1865
#define CRCXOR2                       1866
#define XOR3                          1867
#define CRCXOR3                       1868
#define XOR4                          1869
#define CRCXOR4                       1870
#define XOR5                          1871
#define CRCXOR5                       1872
#define XOR6                          1873
#define CRCXOR6                       1874
#define XOR7                          1875
#define CRCXOR7                       1876
#define CRCXORH                       1877
#define XOR8                          1878
#define CRCXOR8                       1879
#define XOR9                          1880
#define CRCXOR9                       1881
#define CRCXOR10                      1882
#define XOR10                         1883
#define CRCXOR11                      1884
#define XOR11                         1885
#define XOR12                         1886
#define CRCXOR12                      1887
#define XOR13                         1888
#define CRCXOR13                      1889
#define CRCXOR14                      1890
#define XOR14                         1891
#define CRCXOR15                      1892
#define XOR15                         1893
#define CRCCON0                       1894
#define CRCFULL                       1895
#define FULL                          1896
#define CRCSHIFTM                     1897
#define SHIFTM                        1898
#define ACCM                          1899
#define CRCACCM                       1900
#define CRCCON0_BUSY                  1901
#define CRCBUSY                       1902
#define CRCGO                         1903
#define CRCCON0_EN                    1904
#define CRCEN                         1905
#define CRCCON1                       1906
#define PLEN0                         1907
#define CRCPLEN0                      1908
#define PLEN                          1909
#define CRCPLEN                       1910
#define PLEN1                         1911
#define CRCPLEN1                      1912
#define PLEN2                         1913
#define CRCPLEN2                      1914
#define PLEN3                         1915
#define CRCPLEN3                      1916
#define DLEN                          1917
#define CRCDLEN                       1918
#define CRCDLEN0                      1919
#define DLEN0                         1920
#define DLEN1                         1921
#define CRCDLEN1                      1922
#define CRCDLEN2                      1923
#define DLEN2                         1924
#define DLEN3                         1925
#define CRCDLEN3                      1926
#define AT1RESL                       1927
#define AT1RES0                       1928
#define RES0                          1929
#define RES1                          1930
#define AT1RES1                       1931
#define AT1RES2                       1932
#define RES2                          1933
#define AT1RES3                       1934
#define RES3                          1935
#define AT1RES4                       1936
#define RES4                          1937
#define AT1RES5                       1938
#define RES5                          1939
#define RES6                          1940
#define AT1RES6                       1941
#define AT1RES7                       1942
#define RES7                          1943
#define AT1RESH                       1944
#define RES8                          1945
#define AT1RES8                       1946
#define RES9                          1947
#define AT1RES9                       1948
#define AT1MISSL                      1949
#define AT1MISS0                      1950
#define MISS0                         1951
#define AT1MISS1                      1952
#define MISS1                         1953
#define AT1MISS2                      1954
#define MISS2                         1955
#define AT1MISS3                      1956
#define MISS3                         1957
#define AT1MISS4                      1958
#define MISS4                         1959
#define AT1MISS5                      1960
#define MISS5                         1961
#define AT1MISS6                      1962
#define MISS6                         1963
#define AT1MISS7                      1964
#define MISS7                         1965
#define AT1MISSH                      1966
#define MISS8                         1967
#define AT1MISS8                      1968
#define MISS9                         1969
#define AT1MISS9                      1970
#define MISS10                        1971
#define AT1MISS10                     1972
#define MISS11                        1973
#define AT1MISS11                     1974
#define AT1MISS12                     1975
#define MISS12                        1976
#define AT1MISS13                     1977
#define MISS13                        1978
#define AT1MISS14                     1979
#define MISS14                        1980
#define AT1MISS15                     1981
#define MISS15                        1982
#define AT1PERL                       1983
#define PER0                          1984
#define AT1PER0                       1985
#define PERL0                         1986
#define PER1                          1987
#define AT1PER1                       1988
#define PERL1                         1989
#define PER2                          1990
#define AT1PER2                       1991
#define PERL2                         1992
#define PER3                          1993
#define AT1PER3                       1994
#define PERL3                         1995
#define PER4                          1996
#define AT1PER4                       1997
#define PERL4                         1998
#define PER5                          1999
#define AT1PER5                       2000
#define PERL5                         2001
#define PER6                          2002
#define AT1PER6                       2003
#define PERL6                         2004
#define PER7                          2005
#define AT1PER7                       2006
#define PERL7                         2007
#define AT1PERH                       2008
#define PER8                          2009
#define AT1PER8                       2010
#define PERH0                         2011
#define PER9                          2012
#define AT1PER9                       2013
#define PERH1                         2014
#define AT1PER10                      2015
#define PER10                         2016
#define PERH2                         2017
#define AT1PER11                      2018
#define PER11                         2019
#define PERH3                         2020
#define AT1PER12                      2021
#define PER12                         2022
#define PERH4                         2023
#define AT1PER13                      2024
#define PER13                         2025
#define PERH5                         2026
#define AT1PER14                      2027
#define PER14                         2028
#define PERH6                         2029
#define PER15                         2030
#define AT1POV                        2031
#define PERH7                         2032
#define AT1PHSL                       2033
#define PHS0                          2034
#define AT1PHS0                       2035
#define PHS1                          2036
#define AT1PHS1                       2037
#define PHS2                          2038
#define AT1PHS2                       2039
#define PHS3                          2040
#define AT1PHS3                       2041
#define PHS4                          2042
#define AT1PHS4                       2043
#define PHS5                          2044
#define AT1PHS5                       2045
#define PHS6                          2046
#define AT1PHS6                       2047
#define PHS7                          2048
#define AT1PHS7                       2049
#define AT1PHSH                       2050
#define PHSL8                         2051
#define PHS8                          2052
#define AT1PHS8                       2053
#define PHSL9                         2054
#define PHS9                          2055
#define AT1PHS9                       2056
#define AT1CON0                       2057
#define AT1CON0_MODE                  2058
#define AT1MODE                       2059
#define APMOD                         2060
#define AT1APMOD                      2061
#define AT1CON0_POL                   2062
#define AT1POL                        2063
#define AT1PS0                        2064
#define AT1CON0_PS                    2065
#define AT1PS                         2066
#define AT1CON0_PS0                   2067
#define AT1PS1                        2068
#define AT1CON0_PS1                   2069
#define PREC                          2070
#define AT1PREC                       2071
#define AT1CON0_EN                    2072
#define AT1EN                         2073
#define AT1CON1                       2074
#define AT1VALID                      2075
#define VALID                         2076
#define AT1ACCS                       2077
#define ACCS                          2078
#define MPP                           2079
#define AT1MPP                        2080
#define AT1PRP                        2081
#define PRP                           2082
#define AT1PHP                        2083
#define PHP                           2084
#define AT1IR0                        2085
#define AT1PERIF                      2086
#define AT1MISSIF                     2087
#define AT1PHSIF                      2088
#define AT1IE0                        2089
#define AT1PERIE                      2090
#define AT1MISSIE                     2091
#define AT1PHSIE                      2092
#define AT1IR1                        2093
#define AT1CC1IF                      2094
#define AT1CC2IF                      2095
#define AT1CC3IF                      2096
#define AT1IE1                        2097
#define AT1CC1IE                      2098
#define AT1CC2IE                      2099
#define AT1CC3IE                      2100
#define AT1STPTL                      2101
#define STPT0                         2102
#define AT1STPT0                      2103
#define STPT1                         2104
#define AT1STPT1                      2105
#define STPT2                         2106
#define AT1STPT2                      2107
#define STPT3                         2108
#define AT1STPT3                      2109
#define STPT4                         2110
#define AT1STPT4                      2111
#define STPT5                         2112
#define AT1STPT5                      2113
#define STPT6                         2114
#define AT1STPT6                      2115
#define STPT7                         2116
#define AT1STPT7                      2117
#define AT1STPTH                      2118
#define STPT8                         2119
#define AT1STPT8                      2120
#define STPT9                         2121
#define AT1STPT9                      2122
#define AT1STPT10                     2123
#define STPT10                        2124
#define AT1STPT11                     2125
#define STPT11                        2126
#define AT1STPT12                     2127
#define STPT12                        2128
#define AT1STPT13                     2129
#define STPT13                        2130
#define AT1STPT14                     2131
#define STPT14                        2132
#define AT1ERRL                       2133
#define AT1ERR0                       2134
#define ERR0                          2135
#define ERRL0                         2136
#define AT1ERR1                       2137
#define ERR1                          2138
#define ERRL1                         2139
#define AT1ERR2                       2140
#define ERR2                          2141
#define ERRL2                         2142
#define AT1ERR3                       2143
#define ERR3                          2144
#define ERRL3                         2145
#define AT1ERR4                       2146
#define ERRL4                         2147
#define ERR4                          2148
#define AT1ERR5                       2149
#define ERRL5                         2150
#define ERR5                          2151
#define AT1ERR6                       2152
#define ERRL6                         2153
#define ERR6                          2154
#define AT1ERR7                       2155
#define ERRL7                         2156
#define ERR7                          2157
#define AT1ERRH                       2158
#define AT1ERR8                       2159
#define ERRH0                         2160
#define ERR8                          2161
#define AT1ERR9                       2162
#define ERRH1                         2163
#define ERR9                          2164
#define AT1ERR10                      2165
#define ERR10                         2166
#define ERRH2                         2167
#define AT1ERR11                      2168
#define ERR11                         2169
#define ERRH3                         2170
#define AT1ERR12                      2171
#define ERR12                         2172
#define ERRH4                         2173
#define AT1ERR13                      2174
#define ERR13                         2175
#define ERRH5                         2176
#define AT1ERR14                      2177
#define ERR14                         2178
#define ERRH6                         2179
#define AT1ERR15                      2180
#define ERR15                         2181
#define ERRH7                         2182
#define AT1CLK                        2183
#define AT1CLK_CS                     2184
#define AT1CS                         2185
#define AT1CLK_CS0                    2186
#define AT1CS0                        2187
#define AT1SIG                        2188
#define AT1SSEL0                      2189
#define AT1SIG_SSEL0                  2190
#define AT1SIG_SSEL                   2191
#define AT1SSEL                       2192
#define AT1SSEL1                      2193
#define AT1SIG_SSEL1                  2194
#define AT1SSEL2                      2195
#define AT1SIG_SSEL2                  2196
#define AT1CSEL1                      2197
#define CP1S0                         2198
#define AT1CP1S0                      2199
#define AT1CP1S                       2200
#define CP1S                          2201
#define CP1S1                         2202
#define AT1CP1S1                      2203
#define CP1S2                         2204
#define AT1CP1S2                      2205
#define AT1CC1L                       2206
