tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1618_tdd.h
#define T3GPPS3                       2765
#define T3GPPS4                       2766
#define T4PPS                         2767
#define T4PPS0                        2768
#define T4PPS1                        2769
#define T4PPS2                        2770
#define T4PPS3                        2771
#define T4PPS4                        2772
#define T5CKIPPS                      2773
#define T5CKIPPS0                     2774
#define T5CKIPPS1                     2775
#define T5CKIPPS2                     2776
#define T5CKIPPS3                     2777
#define T5CKIPPS4                     2778
#define T5GPPS                        2779
#define T5GPPS0                       2780
#define T5GPPS1                       2781
#define T5GPPS2                       2782
#define T5GPPS3                       2783
#define T5GPPS4                       2784
#define T6PPS                         2785
#define T6PPS0                        2786
#define T6PPS1                        2787
#define T6PPS2                        2788
#define T6PPS3                        2789
#define T6PPS4                        2790
#define ATCC1PPS                      2791
#define ATCC1PPS0                     2792
#define ATCC1PPS1                     2793
#define ATCC1PPS2                     2794
#define ATCC1PPS3                     2795
#define ATCC1PPS4                     2796
#define SSPCLKPPS                     2797
#define SSPCLKPPS0                    2798
#define SSPCLKPPS1                    2799
#define SSPCLKPPS2                    2800
#define SSPCLKPPS3                    2801
#define SSPCLKPPS4                    2802
#define SSPDATPPS                     2803
#define SSPDATPPS0                    2804
#define SSPDATPPS1                    2805
#define SSPDATPPS2                    2806
#define SSPDATPPS3                    2807
#define SSPDATPPS4                    2808
#define SSPSSPPS                      2809
#define SSPSSPPS0                     2810
#define SSPSSPPS1                     2811
#define SSPSSPPS2                     2812
#define SSPSSPPS3                     2813
#define SSPSSPPS4                     2814
#define ATCC2PPS                      2815
#define ATCC2PPS0                     2816
#define ATCC2PPS1                     2817
#define ATCC2PPS2                     2818
#define ATCC2PPS3                     2819
#define ATCC2PPS4                     2820
#define RXPPS                         2821
#define RXPPS0                        2822
#define RXPPS1                        2823
#define RXPPS2                        2824
#define RXPPS3                        2825
#define RXPPS4                        2826
#define CKPPS                         2827
#define CKPPS0                        2828
#define CKPPS1                        2829
#define CKPPS2                        2830
#define CKPPS3                        2831
#define CKPPS4                        2832
#define SMT1SIGPPS                    2833
#define SMT1SIGPPS0                   2834
#define SMT1SIGPPS1                   2835
#define SMT1SIGPPS2                   2836
#define SMT1SIGPPS3                   2837
#define SMT1SIGPPS4                   2838
#define SMT1WINPPS                    2839
#define SMTWINPPS0                    2840
#define SMTWINPPS1                    2841
#define SMTWINPPS2                    2842
#define SMTWINPPS3                    2843
#define SMTWINPPS4                    2844
#define CLCIN0PPS                     2845
#define CLCIN0PPS0                    2846
#define CLCIN0PPS1                    2847
#define CLCIN0PPS2                    2848
#define CLCIN0PPS3                    2849
#define CLCIN0PPS4                    2850
#define CLCIN1PPS                     2851
#define CLCIN1PPS0                    2852
#define CLCIN1PPS1                    2853
#define CLCIN1PPS2                    2854
#define CLCIN1PPS3                    2855
#define CLCIN1PPS4                    2856
#define CLCIN2PPS                     2857
#define CLCIN2PPS0                    2858
#define CLCIN2PPS1                    2859
#define CLCIN2PPS2                    2860
#define CLCIN2PPS3                    2861
#define CLCIN2PPS4                    2862
#define CLCIN3PPS                     2863
#define CLCIN3PPS0                    2864
#define CLCIN3PPS1                    2865
#define CLCIN3PPS2                    2866
#define CLCIN3PPS3                    2867
#define CLCIN3PPS4                    2868
#define SMT2SIGPPS                    2869
#define SMT2SIGPPS0                   2870
#define SMT2SIGPPS1                   2871
#define SMT2SIGPPS2                   2872
#define SMT2SIGPPS3                   2873
#define SMT2SIGPPS4                   2874
#define SMT2WINPPS                    2875
#define SMT2WINPPS0                   2876
#define SMT2WINPPS1                   2877
#define SMT2WINPPS2                   2878
#define SMT2WINPPS3                   2879
#define SMT2WINPPS4                   2880
#define ATCC3PPS                      2881
#define ATCC3PPS0                     2882
#define ATCC3PPS1                     2883
#define ATCC3PPS2                     2884
#define ATCC3PPS3                     2885
#define ATCC3PPS4                     2886
#define RA0PPS                        2887
#define RA0PPS0                       2888
#define RA0PPS1                       2889
#define RA0PPS2                       2890
#define RA0PPS3                       2891
#define RA0PPS4                       2892
#define RA1PPS                        2893
#define RA1PPS0                       2894
#define RA1PPS1                       2895
#define RA1PPS2                       2896
#define RA1PPS3                       2897
#define RA1PPS4                       2898
#define RA2PPS                        2899
#define RA2PPS0                       2900
#define RA2PPS1                       2901
#define RA2PPS2                       2902
#define RA2PPS3                       2903
#define RA2PPS4                       2904
#define RA4PPS                        2905
#define RA4PPS0                       2906
#define RA4PPS1                       2907
#define RA4PPS2                       2908
#define RA4PPS3                       2909
#define RA4PPS4                       2910
#define RA5PPS                        2911
#define RA5PPS0                       2912
#define RA5PPS1                       2913
#define RA5PPS2                       2914
#define RA5PPS3                       2915
#define RA5PPS4                       2916
#define RB4PPS                        2917
#define RB4PPS0                       2918
#define RB4PPS1                       2919
#define RB4PPS2                       2920
#define RB4PPS3                       2921
#define RB4PPS4                       2922
#define RB5PPS                        2923
#define RB5PPS0                       2924
#define RB5PPS1                       2925
#define RB5PPS2                       2926
#define RB5PPS3                       2927
#define RB5PPS4                       2928
#define RB6PPS                        2929
#define RB6PPS0                       2930
#define RB6PPS1                       2931
#define RB6PPS2                       2932
#define RB6PPS3                       2933
#define RB6PPS4                       2934
#define RB7PPS                        2935
#define RB7PPS0                       2936
#define RB7PPS1                       2937
#define RB7PPS2                       2938
#define RB7PPS3                       2939
#define RB7PPS4                       2940
#define RC0PPS                        2941
#define RC0PPS0                       2942
#define RC0PPS1                       2943
#define RC0PPS2                       2944
#define RC0PPS3                       2945
#define RC0PPS4                       2946
#define RC1PPS                        2947
#define RC1PPS0                       2948
#define RC1PPS1                       2949
#define RC1PPS2                       2950
#define RC1PPS3                       2951
#define RC1PPS4                       2952
#define RC2PPS                        2953
#define RC2PPS0                       2954
#define RC2PPS1                       2955
#define RC2PPS2                       2956
#define RC2PPS3                       2957
#define RC2PPS4                       2958
#define RC3PPS                        2959
#define RC3PPS0                       2960
#define RC3PPS1                       2961
#define RC3PPS2                       2962
#define RC3PPS3                       2963
#define RC3PPS4                       2964
#define RC4PPS                        2965
#define RC4PPS0                       2966
#define RC4PPS1                       2967
#define RC4PPS2                       2968
#define RC4PPS3                       2969
#define RC4PPS4                       2970
#define RC5PPS                        2971
#define RC5PPS0                       2972
#define RC5PPS1                       2973
#define RC5PPS2                       2974
#define RC5PPS3                       2975
#define RC5PPS4                       2976
#define RC6PPS                        2977
#define RC6PPS0                       2978
#define RC6PPS1                       2979
#define RC6PPS2                       2980
#define RC6PPS3                       2981
#define RC6PPS4                       2982
#define RC7PPS                        2983
#define RC7PPS0                       2984
#define RC7PPS1                       2985
#define RC7PPS2                       2986
#define RC7PPS3                       2987
#define RC7PPS4                       2988
#define CLCDATA                       2989
#define MLC1OUT                       2990
#define MLC2OUT                       2991
#define CLC1CON                       2992
#define CLC1CON_MODE                  2993
#define LC1MODE0                      2994
#define LC1MODE                       2995
#define CLC1CON_MODE0                 2996
#define LC1MODE1                      2997
#define CLC1CON_MODE1                 2998
#define LC1MODE2                      2999
#define CLC1CON_MODE2                 3000
#define LC1INTN                       3001
#define CLC1CON_INTN                  3002
#define LC1INTP                       3003
#define CLC1CON_INTP                  3004
#define LC1OUT                        3005
#define CLC1CON_OUT                   3006
#define LC1EN                         3007
#define CLC1CON_EN                    3008
#define CLC1POL                       3009
#define LC1G1POL                      3010
#define CLC1POL_G1POL                 3011
#define CLC1POL_G2POL                 3012
#define LC1G2POL                      3013
#define LC1G3POL                      3014
#define CLC1POL_G3POL                 3015
#define LC1G4POL                      3016
#define CLC1POL_G4POL                 3017
#define CLC1POL_POL                   3018
#define LC1POL                        3019
#define CLC1SEL0                      3020
#define CLC1SEL0_D1S0                 3021
#define LC1D1S0                       3022
#define CLC1SEL0_D1S                  3023
#define LC1D1S                        3024
#define CLC1SEL0_D1S1                 3025
#define LC1D1S1                       3026
#define CLC1SEL0_D1S2                 3027
#define LC1D1S2                       3028
#define LC1D1S3                       3029
#define CLC1SEL0_D1S3                 3030
#define CLC1SEL0_D1S4                 3031
#define LC1D1S4                       3032
#define CLC1SEL0_D1S5                 3033
#define LC1D1S5                       3034
#define CLC1SEL1                      3035
#define CLC1SEL1_D2S0                 3036
#define CLC1SEL1_D2S                  3037
#define LC1D2S                        3038
#define LC1D2S0                       3039
#define CLC1SEL1_D2S1                 3040
#define LC1D2S1                       3041
#define CLC1SEL1_D2S2                 3042
#define LC1D2S2                       3043
#define LC1D2S3                       3044
#define CLC1SEL1_D2S3                 3045
#define LC1D2S4                       3046
#define CLC1SEL1_D2S4                 3047
#define LC1D2S5                       3048
#define CLC1SEL1_D2S5                 3049
#define CLC1SEL2                      3050
#define LC1D3S0                       3051
#define CLC1SEL2_D3S                  3052
#define LC1D3S                        3053
#define CLC1SEL2_D3S0                 3054
#define LC1D3S1                       3055
#define CLC1SEL2_D3S1                 3056
#define LC1D3S2                       3057
#define CLC1SEL2_D3S2                 3058
#define LC1D3S3                       3059
#define CLC1SEL2_D3S3                 3060
#define LC1D3S4                       3061
#define CLC1SEL2_D3S4                 3062
#define LC1D3S5                       3063
#define CLC1SEL2_D3S5                 3064
#define CLC1SEL3                      3065
#define CLC1SEL3_D4S                  3066
#define LC1D4S                        3067
#define LC1D4S0                       3068
#define CLC1SEL3_D4S0                 3069
#define CLC1SEL3_D4S1                 3070
#define LC1D4S1                       3071
#define LC1D4S2                       3072
#define CLC1SEL3_D4S2                 3073
#define LC1D4S3                       3074
#define CLC1SEL3_D4S3                 3075
#define LC1D4S4                       3076
#define CLC1SEL3_D4S4                 3077
#define LC1D4S5                       3078
#define CLC1SEL3_D4S5                 3079
#define CLC1GLS0                      3080
#define CLC1GLS0_D1N                  3081
#define LC1G1D1N                      3082
#define CLC1GLS0_D1T                  3083
#define LC1G1D1T                      3084
#define LC1G1D2N                      3085
#define CLC1GLS0_D2N                  3086
#define LC1G1D2T                      3087
#define CLC1GLS0_D2T                  3088
#define CLC1GLS0_D3N                  3089
#define LC1G1D3N                      3090
#define CLC1GLS0_D3T                  3091
#define LC1G1D3T                      3092
#define CLC1GLS0_D4N                  3093
#define LC1G1D4N                      3094
#define CLC1GLS0_D4T                  3095
#define LC1G1D4T                      3096
#define CLC1GLS1                      3097
#define CLC1GLS1_D1N                  3098
#define LC1G2D1N                      3099
#define LC1G2D1T                      3100
#define CLC1GLS1_D1T                  3101
#define CLC1GLS1_D2N                  3102
#define LC1G2D2N                      3103
#define LC1G2D2T                      3104
#define CLC1GLS1_D2T                  3105
#define CLC1GLS1_D3N                  3106
#define LC1G2D3N                      3107
#define LC1G2D3T                      3108
#define CLC1GLS1_D3T                  3109
#define CLC1GLS1_D4N                  3110
#define LC1G2D4N                      3111
#define LC1G2D4T                      3112
#define CLC1GLS1_D4T                  3113
#define CLC1GLS2                      3114
#define CLC1GLS2_D1N                  3115
#define LC1G3D1N                      3116
#define LC1G3D1T                      3117
#define CLC1GLS2_D1T                  3118
#define LC1G3D2N                      3119
#define CLC1GLS2_D2N                  3120
#define LC1G3D2T                      3121
#define CLC1GLS2_D2T                  3122
#define CLC1GLS2_D3N                  3123
#define LC1G3D3N                      3124
#define LC1G3D3T                      3125
#define CLC1GLS2_D3T                  3126
#define LC1G3D4N                      3127
#define CLC1GLS2_D4N                  3128
#define LC1G3D4T                      3129
#define CLC1GLS2_D4T                  3130
#define CLC1GLS3                      3131
#define LC1G4D1N                      3132
#define CLC1GLS3_G4D1N                3133
#define LC1G4D1T                      3134
#define CLC1GLS3_G4D1T                3135
#define CLC1GLS3_G4D2N                3136
#define LC1G4D2N                      3137
#define CLC1GLS3_G4D2T                3138
#define LC1G4D2T                      3139
#define LC1G4D3N                      3140
#define CLC1GLS3_G4D3N                3141
#define LC1G4D3T                      3142
#define CLC1GLS3_G4D3T                3143
#define CLC1GLS3_G4D4N                3144
#define LC1G4D4N                      3145
#define CLC1GLS3_G4D4T                3146
#define LC1G4D4T                      3147
#define CLC2CON                       3148
#define LC2MODE0                      3149
#define CLC2CON_MODE                  3150
#define LC2MODE                       3151
#define CLC2CON_MODE0                 3152
#define LC2MODE1                      3153
#define CLC2CON_MODE1                 3154
#define LC2MODE2                      3155
#define CLC2CON_MODE2                 3156
#define LC2INTN                       3157
#define CLC2CON_INTN                  3158
#define LC2INTP                       3159
#define CLC2CON_INTP                  3160
#define CLC2CON_OUT                   3161
#define LC2OUT                        3162
#define CLC2CON_EN                    3163
#define LC2EN                         3164
#define CLC2POL                       3165
#define LC2G1POL                      3166
#define CLC2POL_G1POL                 3167
#define LC2G2POL                      3168
#define CLC2POL_G2POL                 3169
#define LC2G3POL                      3170
#define CLC2POL_G3POL                 3171
#define LC2G4POL                      3172
#define CLC2POL_G4POL                 3173
#define CLC2POL_POL                   3174
#define LC2POL                        3175
#define CLC2SEL0                      3176
#define CLC2SEL0_D1S                  3177
#define LC2D1S0                       3178
#define CLC2SEL0_D1S0                 3179
#define LC2D1S                        3180
#define LC2D1S1                       3181
#define CLC2SEL0_D1S1                 3182
#define LC2D1S2                       3183
#define CLC2SEL0_D1S2                 3184
#define CLC2SEL0_D1S3                 3185
#define LC2D1S3                       3186
#define LC2D1S4                       3187
#define CLC2SEL0_D1S4                 3188
#define LC2D1S5                       3189
#define CLC2SEL0_D1S5                 3190
#define CLC2SEL1                      3191
#define LC2D2S0                       3192
#define CLC2SEL1_D2S0                 3193
#define LC2D2S                        3194
#define CLC2SEL1_D2S                  3195
#define LC2D2S1                       3196
#define CLC2SEL1_D2S1                 3197
#define LC2D2S2                       3198
#define CLC2SEL1_D2S2                 3199
#define LC2D2S3                       3200
#define CLC2SEL1_D2S3                 3201
#define LC2D2S4                       3202
#define CLC2SEL1_D2S4                 3203
#define LC2D2S5                       3204
#define CLC2SEL1_D2S5                 3205
#define CLC2SEL2                      3206
#define CLC2SEL2_D3S                  3207
#define LC2D3S0                       3208
#define CLC2SEL2_D3S0                 3209
#define LC2D3S                        3210
#define CLC2SEL2_D3S1                 3211
#define LC2D3S1                       3212
#define LC2D3S2                       3213
#define CLC2SEL2_D3S2                 3214
#define LC2D3S3                       3215
#define CLC2SEL2_D3S3                 3216
#define LC2D3S4                       3217
#define CLC2SEL2_D3S4                 3218
#define LC2D3S5                       3219
#define CLC2SEL2_D3S5                 3220
#define CLC2SEL3                      3221
#define LC2D4S0                       3222
#define CLC2SEL3_D4S                  3223
#define CLC2SEL3_D4S0                 3224
#define LC2D4S                        3225
#define LC2D4S1                       3226
#define CLC2SEL3_D4S1                 3227
#define LC2D4S2                       3228
#define CLC2SEL3_D4S2                 3229
#define CLC2SEL3_D4S3                 3230
#define LC2D4S3                       3231
#define LC2D4S4                       3232
#define CLC2SEL3_D4S4                 3233
#define LC2D4S5                       3234
#define CLC2SEL3_D4S5                 3235
#define CLC2GLS0                      3236
#define LC2G1D1N                      3237
#define CLC2GLS0_D1N                  3238
#define CLC2GLS0_D1T                  3239
#define LC2G1D1T                      3240
#define LC2G1D2N                      3241
#define CLC2GLS0_D2N                  3242
#define CLC2GLS0_D2T                  3243
#define LC2G1D2T                      3244
#define LC2G1D3N                      3245
#define CLC2GLS0_D3N                  3246
#define CLC2GLS0_D3T                  3247
#define LC2G1D3T                      3248
#define LC2G1D4N                      3249
#define CLC2GLS0_D4N                  3250
#define CLC2GLS0_D4T                  3251
#define LC2G1D4T                      3252
#define CLC2GLS1                      3253
#define CLC2GLS1_D1N                  3254
#define LC2G2D1N                      3255
#define CLC2GLS1_D1T                  3256
#define LC2G2D1T                      3257
#define CLC2GLS1_D2N                  3258
#define LC2G2D2N                      3259
#define CLC2GLS1_D2T                  3260
#define LC2G2D2T                      3261
#define LC2G2D3N                      3262
#define CLC2GLS1_D3N                  3263
#define LC2G2D3T                      3264
#define CLC2GLS1_D3T                  3265
#define LC2G2D4N                      3266
#define CLC2GLS1_D4N                  3267
#define LC2G2D4T                      3268
#define CLC2GLS1_D4T                  3269
#define CLC2GLS2                      3270
#define LC2G3D1N                      3271
#define CLC2GLS2_D1N                  3272
#define CLC2GLS2_D1T                  3273
#define LC2G3D1T                      3274
#define CLC2GLS2_D2N                  3275
#define LC2G3D2N                      3276
#define LC2G3D2T                      3277
#define CLC2GLS2_D2T                  3278
#define CLC2GLS2_D3N                  3279
#define LC2G3D3N                      3280
#define CLC2GLS2_D3T                  3281
#define LC2G3D3T                      3282
#define CLC2GLS2_D4N                  3283
#define LC2G3D4N                      3284
#define LC2G3D4T                      3285
#define CLC2GLS2_D4T                  3286
#define CLC2GLS3                      3287
#define LC2G4D1N                      3288
#define CLC2GLS3_G4D1N                3289
#define CLC2GLS3_G4D1T                3290
#define LC2G4D1T                      3291
#define CLC2GLS3_G4D2N                3292
#define LC2G4D2N                      3293
#define LC2G4D2T                      3294
#define CLC2GLS3_G4D2T                3295
#define CLC2GLS3_G4D3N                3296
#define LC2G4D3N                      3297
#define CLC2GLS3_G4D3T                3298
#define LC2G4D3T                      3299
#define LC2G4D4N                      3300
#define CLC2GLS3_G4D4N                3301
#define CLC2GLS3_G4D4T                3302
#define LC2G4D4T                      3303
#define STATUS_SHAD                   3304
#define C_SHAD                        3305
#define DC_SHAD                       3306
#define Z_SHAD                        3307
#define WREG_SHAD                     3308
#define BSR_SHAD                      3309
#define PCLATH_SHAD                   3310
#define FSR0L_SHAD                    3311
#define FSR0H_SHAD                    3312
#define FSR1L_SHAD                    3313
#define FSR1H_SHAD                    3314
#define STKPTR                        3315
#define TOSL                          3316
#define TOSH                          3317

#endif // _PIC16F1618_H_
